{
  "profile": {
    "name": "Afonso Lima",
    "description": "Full-Stack Developer specialized in modern frontend living in Portugal. I build things with a clear purpose, no gimmicks, straightforward, original. Driven by a creator mentality and good ideas."
  },
  "todo": {
    "title": "Portfolio ToDo",
    "tasks": {
      "tryTodo": "Try the to-do list",
      "switchLanguage": "Switch the website language",
      "exploreProjects": "Explore my projects",
      "visitSocial": "Visit my social media",
      "readAbout": "Read the About Me section",
      "sendMessage": "Send me a message",
      "goTop": "Go back to the top"
    }
  },
  "projects": {
    "title": "My Work",
    "noImg": "No image for this Project",
    "roulette":{
      "button": "Pick a random project",
      "spinning": "Spinning..."
    },
    "list": {
      "PortoBox": {
        "title": "Porto Box Cup",
        "description": "An annual boxing event website to manage registrations, event info, and statistics."
      },
      "ReservationApp": {
        "title": "Reservation Management",
        "description": "Reservation management for businesses: create, cancel, and view reservations; manage bookings and schedules."
      },
      "Photography": {
        "title": "Photography website",
        "description": "Professional photography website showcasing the work of Maria Bragança; specializing in newborn, family, and maternity sessions."
      },
      "Portfolio": {
        "title": "Portfolio Website",
        "description": "This website; make your own conclusion. Also you can check the code."
      },
      "Scrim": {
        "title": "Scrim Image Editor",
        "description": "Lightweight, command-driven image editor in C++; interprets text-based instruction files for image manipulations."
      },
      "Country": {
        "title": "REST Countries API",
        "description": "Country explorer app using an API: view all countries, search, filter by region, see details on a separate page, navigate to bordering countries."
      },
      "Dean": {
        "title": "Dean Rök",
        "description": "Landing page for the artist Dean Rök with modern design and smooth animations; showcases albums, music, and social media."
      }
    }
  },
  "about": {
    "title": "About Me",
    "description": "I'm Afonso Lima, a second-year Computer Engineering student at the Faculty of Engineering of the University of Porto. I work with a focus on front-end development and on building functional, streamlined, and creative solutions. My main tech stack includes React, Node.js, CSS3, PostgreSQL, and C++. I also have strong knowledge of C, Java, Python, and SQLite, along with solid experience in Git, UML, and UI Design. Outside the digital world, I'm a national boxing champion, an important part of my background and identity. I keep things straightforward: clear problems, direct solutions, and consistent results."
  }
}