{
  "profile": {
    "name": "Afonso Lima",
    "description": "Full-Stack Developer specialized in modern frontend. I build things with a clear purpose, no gimmicks, straightforward, original. Driven by a creator mentality and good ideas."
  },
  "todo": {
    "title": "Portfolio ToDo",
    "tasks": {
      "tryTodo": "Try the to-do list",
      "switchLanguage": "Switch the website language",
      "exploreProjects": "Explore my projects",
      "visitSocial": "Visit my social media",
      "readAbout": "Read the About Me section",
      "sendMessage": "Send me a message",
      "goTop": "Go back to the top"
    }
  },
  "projects": {
    "title": "My Projects",
    "noImg": "No image for this Project",
    "list":{
      "PortoBox": {
        "title": "Porto Box Cup",
        "description": "An annual boxing event website to manage registrations, event info, and statistics."
      },
      "ReservationApp": {
        "title": "Reservation Management",
        "description": "This reservation management application helps businesses manage bookings and schedules efficiently, allowing users to create, cancel, and view reservations through a clean and intuitive interface."
      },
      "Photography": {
        "title": "Photography website",
        "description": "Maria Bragança Fotografia is a professional photography website showcasing the work of Maria Bragança, specializing in newborn, family, and maternity sessions, with an elegant design and easy client contact."
      },
      "Portfolio": {
        "title": "Portfolio Website",
        "description": "This website, make your own conclusion... Also you can check the code"
      },
      "Scrim": {
        "title": "Scrim Image Editor",
        "description": "A lightweight, command-driven image editor built in C++, capable of interpreting text-based instruction files to perform image manipulations like creating blank images, adding images, applying effects, and saving the results."
      },
      "Country": {
        "title": "REST Countries API",
        "description": "A country explorer app using an API. Users can view all countries, search, filter by region, see details on a separate page, navigate to bordering countries, and toggle light/dark mode."
      }
    }
  },
  "about": {
    "title": "About Me",
    "description": "I'm Afonso Lima, a second-year Computer Engineering student at the Faculty of Engineering of the University of Porto. I work with a focus on front-end development and on building functional, streamlined, and creative solutions. My main tech stack includes React, Node.js, CSS3, PostgreSQL, and C++. I also have strong knowledge of C, Java, Python, and SQLite, along with solid experience in Git, UML, and UI Design. Outside the digital world, I'm a national boxing champion, an important part of my background and identity. I keep things straightforward: clear problems, direct solutions, and consistent results."
  }
}