{
  "profile": {
    "name": "Afonso Lima",
    "description": "Desenvolvedor Full-Stack especializado em frontend moderno. Construo com um propósito claro, direto e original. Impulsionado por uma mentalidade criativa e boas ideias."
  },
  "todo": {
    "title": "Tarefas do Portfólio",
    "tasks": {
      "tryTodo": "Experimentar a lista de tarefas",
      "switchLanguage": "Mudar o idioma do website",
      "exploreProjects": "Explorar os meus projetos",
      "visitSocial": "Visitar as minhas redes sociais",
      "readAbout": "Ler a secção Sobre Mim",
      "sendMessage": "Enviar-me uma mensagem",
      "goTop": "Voltar ao topo"
    }
  },
  "projects": {
    "title": "O meu trabalho",
    "noImg": "Projeto sem imagem",
    "list": {
      "PortoBox": {
        "title": "Porto Box Cup",
        "description": "Site do Maior Evento de Boxe Anual da Europa com informações, estatisticas, páginas para equipas e sistema de registos."
      },
      "ReservationApp": {
        "title": "Gestão de Reservas",
        "description": "Gestão de reservas para empresas: criar, cancelar e consultar reservas; gerir marcações e horários."
      },
      "Photography": {
        "title": "Artista fotográfica",
        "description": "Site Maria Bragança Fotografia apresentando o trabalho de Maria Bragança; especializada em recém-nascidos, família e maternidade."
      },
      "Portfolio": {
        "title": "Site Portfolio",
        "description": "Este website... tira as conclusões. Também podes consultar o código."
      },
      "Scrim": {
        "title": "Editor de imagem Scrim",
        "description": "Editor de imagens leve, baseado em comandos, em C++; interpreta ficheiros de instruções em texto para manipulações de imagem."
      },
      "Country": {
        "title": "Explorador de Países",
        "description": "Exploração de países com API: ver países, pesquisar, filtrar por região, ver detalhes e navegar para países vizinhos."
      },
      "Dean": {
        "title": "Dean Rök",
        "description": "Landing page para o artista Dean Rök, com design moderno e animações fluidas; apresenta álbuns, músicas e redes sociais."
      }
    }
  },
  "about": {
    "title": "Sobre Mim",
    "description": "Afonso Lima, estudante do segundo ano de Engenharia Informática na Faculdade de Engenharia da Universidade do Porto. Trabalho com foco em front-end e na criação de soluções funcionais e creativas. O meu tech stack principal é React, Node.js, CSS3, PostgreSQL e C++. Além disso, tenho bom domínio de C, Java, Python e SQLite, e experiência sólida com Git, UML e UI Design. Fora do mundo digital, sou campeão nacional de boxe, algo que faz parte do meu percurso e identidade. Gosto de manter as coisas objetivas: problemas claros, soluções diretas e resultados consistentes"
  }
}