
{
  "profile": {
    "name": "Afonso Lima",
    "description": "Desenvolvedor Full-Stack especializado em frontend moderno. Construo com um propósito claro, direto e original. Impulsionado por uma mentalidade criadora e boas ideias."
  },
  "todo": {
    "title": "Tarefas do Portfólio",
    "tasks": {
      "tryTodo": "Experimentar a lista de tarefas",
      "switchLanguage": "Mudar o idioma do website",
      "exploreProjects": "Explorar os meus projetos",
      "visitSocial": "Visitar as minhas redes sociais",
      "readAbout": "Ler a secção Sobre Mim",
      "sendMessage": "Enviar-me uma mensagem",
      "goTop": "Voltar ao topo"
    }
  },
  "projects": {
    "title": "O meu trabalho",
    "noImg": "Projeto sem imagem",
    "list":{
      "PortoBox": {
        "title": "Porto Box Cup",
        "description": "Site do Maior Evento de Boxe Anual da Europa com informações, estatisticas, páginas para equipas e sistema de registos"
      },
      "ReservationApp": {
        "title": "Gestão de Reservas",
        "description": "Esta aplicação de gestão de reservas ajuda empresas a gerir marcações e horários de forma eficiente, permitindo criar, cancelar e consultar reservas através de uma interface simples e intuitiva."
      },
      "Photography": {
        "title": "Artista fotográfica",
        "description": "O site Maria Bragança Fotografia apresenta o trabalho da fotógrafa Maria Bragança, especializada em sessões de recém-nascidos, família e maternidade, com um design elegante e contacto fácil para clientes."
      },
      "Portfolio": {
        "title": "Site Portfolio",
        "description": "Este website... tira as conclusões. Também podes consultar o código."
      },
      "Scrim": {
        "title": "Editor de imagem Scrim",
        "description": "Um editor de imagens leve, baseado em comandos, desenvolvido em C++, capaz de interpretar ficheiros de instruções em texto para realizar manipulações de imagem, como criar imagens em branco, adicionar imagens, aplicar efeitos e guardar os resultados."
      },
      "Country": {
        "title": "Explorador de Países",
        "description": "Um site de exploração de países com API. Permite ver todos os países, pesquisar, filtrar por região, ver detalhes, navegar para países vizinhos e alternar entre modo claro/escuro."
      },
      "Dean":{
        "title": "Dean Rök",
        "description": "Um site de landing page para o artista Dean Rök, com um design moderno e animações fluidas. Apresenta os seus álbuns, músicas e redes sociais, e integra a Brevo para recolha de emails e envio de novidades aos fãs. Simples, impactante e focado em conversão."
      }
    }
  },
  "about": {
    "title": "Sobre Mim",
    "description": "Afonso Lima, estudante do segundo ano de Engenharia Informática na Faculdade de Engenharia da Universidade do Porto. Trabalho com foco em front-end e na criação de soluções funcionais e creativas. O meu tech stack principal é React, Node.js, CSS3, PostgreSQL e C++. Além disso, tenho bom domínio de C, Java, Python e SQLite, e experiência sólida com Git, UML e UI Design. Fora do mundo digital, sou campeão nacional de boxe, algo que faz parte do meu percurso e identidade. Gosto de manter as coisas objetivas: problemas claros, soluções diretas e resultados consistentes"
  }
}